{
  "Doc": "facts",
  "facts": [
    "The Indian Constitution is the longest written Constitution in the world, with 448 articles, 12 schedules, and 105 amendments as of 2024.",
    "Dr. B.R. Ambedkar is known as the 'Father of the Indian Constitution' for his pivotal role as the Chairman of the Drafting Committee.",
    "The Constitution was adopted on November 26, 1949, but came into effect on January 26, 1950, celebrated as Republic Day.",
    "The Constituent Assembly, which drafted the Constitution, had 299 members and was chaired by Dr. Rajendra Prasad.",
    "The Preamble to the Constitution declares India to be a Sovereign, Socialist, Secular, Democratic Republic.",
    "Fundamental Rights, enshrined in Part III, guarantee individual freedoms and equality, including the Right to Equality, Freedom, and Constitutional Remedies.",
    "The Directive Principles of State Policy in Part IV aim to establish social and economic democracy by guiding the government in policy-making.",
    "The Constitution provides for a federal system with a unitary bias, balancing power between the central and state governments.",
    "Article 32, described as the 'heart and soul' of the Constitution by Dr. Ambedkar, empowers citizens to approach the Supreme Court for enforcement of Fundamental Rights.",
    "The First Amendment (1951) added restrictions to the right to free speech and introduced land reform laws to abolish zamindari systems.",
    "The 42nd Amendment (1976) is called the 'Mini Constitution' as it introduced significant changes, including the terms 'Socialist' and 'Secular' in the Preamble.",
    "The 'Kesavananda Bharati v. State of Kerala' (1973) case established the doctrine of the Basic Structure, ensuring Parliament cannot alter the fundamental essence of the Constitution.",
    "Fundamental Duties were added by the 42nd Amendment, obliging citizens to respect the Constitution, national symbols, and promote harmony.",
    "India has a parliamentary form of government with the President as the nominal head and the Prime Minister as the executive authority.",
    "The Indian Constitution borrows extensively from other constitutions, including the parliamentary system from the UK and Fundamental Rights from the US Bill of Rights.",
    "It took nearly three years (2 years, 11 months, and 18 days) to draft the Constitution, costing approximately ₹6.3 million.",
    "The Constitution empowers the Supreme Court and High Courts with judicial review to uphold the Constitution's supremacy.",
    "The concept of reservations in education and jobs for Scheduled Castes, Scheduled Tribes, and Other Backward Classes is based on the principle of social justice.",
    "The Right to Information Act (2005) is derived from the constitutional right to freedom of speech and expression under Article 19(1)(a).",
    "The Constitution is a living document, continuously evolving through amendments to reflect societal and political changes."
  ]
}